

/*****************************************************************************
  1 头文件包含
*****************************************************************************/

#include <linux/mux.h>
#include  "test_acore.h"
#include  "test_iomux_drv.h"




#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif



/*****************************************************************************
  2 全局变量定义
*****************************************************************************/


/*****************************************************************************
  3 函数实现
*****************************************************************************/
int test_iomux_get_config(void)
{
    if (0 == iomux_get_block("block_uart0"))
        return ERROR;
    if (0 == iomux_get_blockconfig("block_uart0"))
        return ERROR;
    return OK;
}












#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

